In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20])

In [3]:
obj

0      4
1      5
2      6
3      7
4      8
5      9
6     10
7     11
8     12
9     13
10    14
11    15
12    16
13    17
14    18
15    19
16    20
dtype: int64

In [4]:
type(obj)

pandas.core.series.Series

In [5]:
obj.values

array([ 4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
      dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=17, step=1)

In [7]:
 obj2 = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd']) # ya hum nai index khud day deya hn

In [8]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [9]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
obj2['a'] # ya maina index pass kar han

4

In [11]:
obj2['d']

3

In [12]:
obj2['d'] = 45

In [13]:
obj2['d']

45

In [14]:
# ab multipal values laynai kae liya

In [15]:
obj2[['a','c','d']]

a     4
c    -5
d    45
dtype: int64

In [16]:
# ya multi values a gae

In [17]:
obj2 > 0

a     True
b     True
c    False
d     True
dtype: bool

In [18]:
obj2[obj2>0]

a     4
b     7
d    45
dtype: int64

In [19]:
 sdata = {'Ohio' : 35000,'Txas':71000,'Orgen':1600}
sdata

{'Ohio': 35000, 'Txas': 71000, 'Orgen': 1600}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio     35000
Txas     71000
Orgen     1600
dtype: int64

In [22]:
states = ["Califonia","Ohio","Txas","Orgen"]

In [23]:
obj4 = pd.Series(sdata,index=states)

In [24]:
obj4

Califonia        NaN
Ohio         35000.0
Txas         71000.0
Orgen         1600.0
dtype: float64

In [25]:
type("NaN")

str

In [26]:
pd.isnull(sdata)

False

In [27]:
pd.Categorical

pandas.core.arrays.categorical.Categorical

# # A series is one dimenstion array

In [28]:
objt = pd.Series([1,2,-3,4,-5,7,8])

In [29]:
objt # ya Dekhyn Sequence vise chal rahe han or data be a raha han

0    1
1    2
2   -3
3    4
4   -5
5    7
6    8
dtype: int64

In [30]:
objt.values

array([ 1,  2, -3,  4, -5,  7,  8], dtype=int64)

In [31]:
objt[5]

7

In [32]:
objt.index

RangeIndex(start=0, stop=7, step=1)

In [33]:
objt2 = pd.Series([1,2,3,4,5,6] , index=('a','b','c','d','e','f'))

In [34]:
objt2

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [35]:
objt2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [36]:
objt2['a']

1

In [37]:
objt2.loc['a'] # ya dekhyn same output aya han loc funcation be yahe kaam karta han index kii value lata han

1

In [38]:
# ab ak sa zada index kii value get karni han tu be loc sa kar sakta ho

In [39]:
objt2['d']

4

In [40]:
objt2.loc[['a','d']] # ya dekhyn do index kiiii value lay kar a gaya

a    1
d    4
dtype: int64

In [41]:
objt2['d'] = 10

In [42]:
objt2['d']

10

In [43]:
objt2[['a','d','c']] # ya 3 index values han

a     1
d    10
c     3
dtype: int64

In [44]:
objt2[objt2>0]

a     1
b     2
c     3
d    10
e     5
f     6
dtype: int64

In [45]:
objt2*2

a     2
b     4
c     6
d    20
e    10
f    12
dtype: int64

In [46]:
np.exp(objt2)

a        2.718282
b        7.389056
c       20.085537
d    22026.465795
e      148.413159
f      403.428793
dtype: float64

In [47]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [48]:
objt3 = pd.Series(sdata)

In [49]:
objt3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [51]:
oo = pd.Series(sdata,states)

In [52]:
oo

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
oo.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

In [54]:
oo.values

array([   nan, 35000., 16000., 71000.])

In [55]:
pd.isnull(objt2) # ya sub false is liya ha kae sub values ha  is ma koe be null value nhi han

a    False
b    False
c    False
d    False
e    False
f    False
dtype: bool

In [56]:
pd.isnull(oo) # ya jaha true han waha null value ae han

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [57]:
pd.notnull(oo)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [58]:
objt2

a     1
b     2
c     3
d    10
e     5
f     6
dtype: int64

In [59]:
oo

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [60]:
objt2+oo

California   NaN
Ohio         NaN
Oregon       NaN
Texas        NaN
a            NaN
b            NaN
c            NaN
d            NaN
e            NaN
f            NaN
dtype: float64

In [61]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [62]:
obj3 = pd.Series(sdata)

In [63]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [64]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [65]:
obj4 = pd.Series(sdata, index=states)

In [66]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [67]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [68]:
obj4.name = "poplation"

In [69]:
obj4.index.name = 'states'

In [70]:
obj4

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: poplation, dtype: float64

In [71]:
objt2

a     1
b     2
c     3
d    10
e     5
f     6
dtype: int64

In [72]:
objt2.index = ['Bob', 'Steve', 'Jeff', 'Ryan','Sameer','Abdullah']

In [73]:
objt2

Bob          1
Steve        2
Jeff         3
Ryan        10
Sameer       5
Abdullah     6
dtype: int64

In [74]:
objt2.name = "Values"

In [75]:
objt2.index.name = "Numbers"

In [76]:
objt2

Numbers
Bob          1
Steve        2
Jeff         3
Ryan        10
Sameer       5
Abdullah     6
Name: Values, dtype: int64

In [77]:
objt2

Numbers
Bob          1
Steve        2
Jeff         3
Ryan        10
Sameer       5
Abdullah     6
Name: Values, dtype: int64

In [78]:
import pandas

In [79]:
from pandas import Series,DataFrame

In [80]:
# Converting A dictionary in a Series

In [81]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [82]:
sdata = pd.Series(sdata)

In [83]:
sdata

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [84]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [85]:
sdata = pd.Series(sdata,index=states)

In [86]:
sdata

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [87]:
pd.isnull(sdata)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [88]:
pd.notnull(sdata)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [89]:
sdata

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [90]:
sdata1 = sdata.copy()

In [91]:
sdata1

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [92]:
sdata.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

In [93]:
sdata.index = ['Ohio', 'Oregon', 'Texas', 'California']

In [94]:
sdata

Ohio              NaN
Oregon        35000.0
Texas         16000.0
California    71000.0
dtype: float64

In [95]:
data = {'States':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'Year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [96]:
frame = pd.DataFrame(data)

In [97]:
frame

   States  Year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [98]:
frame.head() # ya by default 5 record print karta han baqiii ap jitnai number dena chaty han tu ap day dayn

   States  Year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [99]:
frame.head(3)

  States  Year  pop
0   Ohio  2000  1.5
1   Ohio  2001  1.7
2   Ohio  2002  3.6

In [100]:
frame.tail() # ya 5 print karta han and kae

   States  Year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# hum ya be kar sakty kae phlay konsa ay column

In [101]:
pd.DataFrame(data,columns=['Year','States','pop'])

   Year  States  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

# # Hum Indexs Be Day Sakty han

In [102]:
Frame2 = pd.DataFrame(data, columns=['Year','States','pop','Data'],
                     index=['one','two','Three','four','Five','Six'])
Frame2['Data'] = range(1,7)

In [103]:
Frame2

       Year  States  pop  Data
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
Three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
Five   2002  Nevada  2.9     5
Six    2003  Nevada  3.2     6

In [104]:
Frame2.columns

Index(['Year', 'States', 'pop', 'Data'], dtype='object')

In [105]:
Frame2.loc['one':'Three']

       Year States  pop  Data
one    2000   Ohio  1.5     1
two    2001   Ohio  1.7     2
Three  2002   Ohio  3.6     3

In [106]:
Frame2.iloc[0:2] # index number daynai kae liya iloc use

     Year States  pop  Data
one  2000   Ohio  1.5     1
two  2001   Ohio  1.7     2

In [107]:
val = pd.Series([-1.2, -1.5, -1.7, 7],index = ['two', 'four', 'five', 'three'])

In [108]:
val

two     -1.2
four    -1.5
five    -1.7
three    7.0
dtype: float64

In [109]:
Frame2['Data1'] = val

In [110]:
Frame2 # ak or column add kar deya han

       Year  States  pop  Data  Data1
one    2000    Ohio  1.5     1    NaN
two    2001    Ohio  1.7     2   -1.2
Three  2002    Ohio  3.6     3    NaN
four   2001  Nevada  2.4     4   -1.5
Five   2002  Nevada  2.9     5    NaN
Six    2003  Nevada  3.2     6    NaN

In [111]:
Frame2['Final'] = ['Pass' if i == "Ohio" else "Fail"  for i in Frame2.States]

In [112]:
Frame2

       Year  States  pop  Data  Data1 Final
one    2000    Ohio  1.5     1    NaN  Pass
two    2001    Ohio  1.7     2   -1.2  Pass
Three  2002    Ohio  3.6     3    NaN  Pass
four   2001  Nevada  2.4     4   -1.5  Fail
Five   2002  Nevada  2.9     5    NaN  Fail
Six    2003  Nevada  3.2     6    NaN  Fail

In [113]:
data = {'Math':[90, 89, 78, 32, 76],
       'Physics':[23, 45, 78, 90, 34],
       'Chemistry':[32, 34, 67, 89, 88]
        }
frame3 = pd.DataFrame(data,index = ['Std1','Std2','Std3','Std4','Std5'])

In [114]:
frame3

      Math  Physics  Chemistry
Std1    90       23         32
Std2    89       45         34
Std3    78       78         67
Std4    32       90         89
Std5    76       34         88

In [115]:
frame3['Total Mask'] = [m+p+c for m,p,c in zip(frame3['Math'],frame3['Physics'],frame3['Chemistry'])]

In [116]:
frame3 # total Mask ka column add ho gaya

      Math  Physics  Chemistry  Total Mask
Std1    90       23         32         145
Std2    89       45         34         168
Std3    78       78         67         223
Std4    32       90         89         211
Std5    76       34         88         198

In [117]:
frame3['Pencentage'] = ["Pass" if m >= 33 and p >= 33 and c >= 33 else "Fail" for m,p,c in zip(frame3['Math'],frame3['Physics'],frame3['Chemistry'])]

In [118]:
frame3 # ya dekhyn hum nai Pencentage

      Math  Physics  Chemistry  Total Mask Pencentage
Std1    90       23         32         145       Fail
Std2    89       45         34         168       Pass
Std3    78       78         67         223       Pass
Std4    32       90         89         211       Fail
Std5    76       34         88         198       Pass

In [119]:
frame = pd.DataFrame(np.arange(100).reshape((20,5)),
                     columns=['Ohio','Texas','California','abc','abc'])

In [120]:
frame

    Ohio  Texas  California  abc  abc
0      0      1           2    3    4
1      5      6           7    8    9
2     10     11          12   13   14
3     15     16          17   18   19
4     20     21          22   23   24
5     25     26          27   28   29
6     30     31          32   33   34
7     35     36          37   38   39
8     40     41          42   43   44
9     45     46          47   48   49
10    50     51          52   53   54
11    55     56          57   58   59
12    60     61          62   63   64
13    65     66          67   68   69
14    70     71          72   73   74
15    75     76          77   78   79
16    80     81          82   83   84
17    85     86          87   88   89
18    90     91          92   93   94
19    95     96          97   98   99

In [121]:
frame.loc[0]

Ohio          0
Texas         1
California    2
abc           3
abc           4
Name: 0, dtype: int32

In [122]:
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10])

In [123]:
s1

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

# index (0-9 default index given bhy series object)

s1[0]

In [124]:
s1[0] # ACCESSING value by index

11

In [125]:
s1[[9,2,4,5,6]]  # accessing multiple values

9    10
2    33
4    55
5    66
6    77
dtype: int64

In [126]:
s1[[4,5,6,7]] = [10,20,30,45]

In [127]:
s1

0    11
1    22
2    33
3    44
4    10
5    20
6    30
7    45
8    99
9    10
dtype: int64

# Creating a series by using a dictionary

In [128]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
data = pd.Series(sdata)
data

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [129]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [130]:
pd.Series(sdata,index=states)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

# Data Frames

In [131]:
data = {'Math':[10,20,30,45,24],
        'Physic':[45,65,75,8,65],
        'Chemistry':[70,80,90,45,60]
       }

In [132]:
datas = pd.DataFrame(data,index=['Std1','Std2','Std3','Std4','Std5'])

In [133]:
datas

      Math  Physic  Chemistry
Std1    10      45         70
Std2    20      65         80
Std3    30      75         90
Std4    45       8         45
Std5    24      65         60

In [135]:
dic = {
    "Ai for EO":[78,89,68,90,87,86,67,49],
    "Python1":[40,78,87,49,88,78,76,75,],
    "Python2":[59,78,87,38,10,98,81,83]
}

df = pd.DataFrame(dic,index=["Nasir", "Asad","Ramsha", 
                              "Mansoor","Saba","Saba",
                              "Hina","Ali"])

In [136]:
df

         Ai for EO  Python1  Python2
Nasir           78       40       59
Asad            89       78       78
Ramsha          68       87       87
Mansoor         90       49       38
Saba            87       88       10
Saba            86       78       98
Hina            67       76       81
Ali             49       75       83

In [137]:
df['Total'] = [a+p+r for a,p,r in zip(df['Ai for EO'],df['Python1'],df['Python2'])]

In [138]:
df

         Ai for EO  Python1  Python2  Total
Nasir           78       40       59    177
Asad            89       78       78    245
Ramsha          68       87       87    242
Mansoor         90       49       38    177
Saba            87       88       10    185
Saba            86       78       98    262
Hina            67       76       81    224
Ali             49       75       83    207

In [143]:
df['Status'] = ["Fail" if num < 200 else "Pass"   for num in df['Total']]

In [144]:
df

         Ai for EO  Python1  Python2  Total Status
Nasir           78       40       59    177   Fail
Asad            89       78       78    245   Pass
Ramsha          68       87       87    242   Pass
Mansoor         90       49       38    177   Fail
Saba            87       88       10    185   Fail
Saba            86       78       98    262   Pass
Hina            67       76       81    224   Pass
Ali             49       75       83    207   Pass

# Where Condion sa check karty han

In [147]:
import numpy as np

In [155]:
df['Where'] = np.where(((df['Ai for EO']<50) & (df['Python1']<50) & (df['Python2'] < 50)),"Pass","Fail")

In [156]:
df

         Ai for EO  Python1  Python2  Total Status Where
Nasir           78       40       59    177   Fail  Fail
Asad            89       78       78    245   Pass  Fail
Ramsha          68       87       87    242   Pass  Fail
Mansoor         90       49       38    177   Fail  Fail
Saba            87       88       10    185   Fail  Fail
Saba            86       78       98    262   Pass  Fail
Hina            67       76       81    224   Pass  Fail
Ali             49       75       83    207   Pass  Fail

In [157]:
df.head()

         Ai for EO  Python1  Python2  Total Status Where
Nasir           78       40       59    177   Fail  Fail
Asad            89       78       78    245   Pass  Fail
Ramsha          68       87       87    242   Pass  Fail
Mansoor         90       49       38    177   Fail  Fail
Saba            87       88       10    185   Fail  Fail

In [158]:
df.tail()

         Ai for EO  Python1  Python2  Total Status Where
Mansoor         90       49       38    177   Fail  Fail
Saba            87       88       10    185   Fail  Fail
Saba            86       78       98    262   Pass  Fail
Hina            67       76       81    224   Pass  Fail
Ali             49       75       83    207   Pass  Fail